==============================
CISCO 1
==============================
enable
conf ter
hostname CISCO_1
inter lo0
ip addr 1.1.1.1 255.255.255.255
exit
inter g0/0
ip addr 210.0.2.2 255.255.255.0
no shut
exit
inter g0/1
ip addr 221.0.0.2 255.255.255.252
no shut
exit
inter g0/2
ip addr 221.0.0.14 255.255.255.252
no shut
exit
inter g0/3
ip addr 221.0.0.25 255.255.255.252
no shut
exit
inter g0/4
ip addr 221.0.0.45 255.255.255.252
no shut
exit
router eigrp 10
eigrp router-id 1.1.1.1
no auto-summary
network 210.0.2.0 0.0.0.255
network 1.1.1.1 0.0.0.0
exit
router bgp 1500
bgp router-id 1.1.1.1
neighbor 221.0.0.1 remote-as 200
neighbor 221.0.0.13 remote-as 300
neighbor 221.0.0.26 remote-as 400
neighbor 221.0.0.46 remote-as 500
neighbor GRUPO_FULLMESH peer-group 
neighbor GRUPO_FULLMESH remote-as 1500
neighbor GRUPO_FULLMESH update-source lo0
neighbor GRUPO_FULLMESH next-hop-self 
neighbor 2.2.2.2 peer-group GRUPO_FULLMESH
neighbor 3.3.3.3 peer-group GRUPO_FULLMESH
neighbor 4.4.4.4 peer-group GRUPO_FULLMESH
neighbor 5.5.5.5 peer-group GRUPO_FULLMESH
neighbor 6.6.6.6 peer-group GRUPO_FULLMESH
address-family ipv4 unicast
network 210.0.7.0 mask 255.255.255.0 
network 210.0.8.0 mask 255.255.255.0 
network 210.0.9.0 mask 255.255.255.0 
network 210.0.10.0 mask 255.255.255.0 
network 210.0.11.0 mask 255.255.255.0
network 210.0.12.0 mask 255.255.255.0 
exit
ip prefix-list SERVER27_30 seq 10 permit 220.0.5.0/24
ip prefix-list SERVER27_30 seq 20 permit 220.0.8.0/24

ip prefix-list SERVER28_31 seq 10 permit 220.0.6.0/24
ip prefix-list SERVER28_31 seq 20 permit 220.0.9.0/24

ip prefix-list SERVER29 permit 220.0.7.0/24

ip prefix-list INTERNET seq 1 permit 0.0.0.0/0 

route-map RUTA_SERVER27_30 permit 10 
set local-preference 150
match ip address prefix-list SERVER27_30
exit
route-map RUTA_SERVER28_31 permit 10 
set local-preference 160
match ip address prefix-list SERVER28_31
exit
route-map RUTA_SERVER29 permit 10 
set local-preference 170
match ip address prefix-list SERVER29
exit
route-map RUTA_INTERNET permit 5 
set local-preference 500
match ip address prefix-list INTERNET
exit

router bgp 1500
address-family ipv4 unicast
neighbor 221.0.0.1 route-map RUTA_SERVER27_30 in 
neighbor 221.0.0.13 route-map RUTA_SERVER28_31 in
neighbor 221.0.0.26 route-map RUTA_SERVER29 in
neighbor 221.0.0.46 route-map RUTA_INTERNET in
exit

==============================
CISCO 2
==============================
enable
conf ter
hostname CISCO_2
inter lo0
ip addr 2.2.2.2 255.255.255.255
exit
inter e0/0
ip addr 210.0.2.1 255.255.255.0
no shut
exit
inter e0/1
ip addr 210.0.1.2 255.255.255.0
no shut
exit
inter e0/2
ip addr 210.0.3.1 255.255.255.0
no shut
exit
inter e0/3
ip addr 210.0.4.1 255.255.255.0
no shut
exit
router eigrp 10
eigrp router-id 2.2.2.2
no auto-summary
network 210.0.1.0 0.0.0.255
network 210.0.2.0 0.0.0.255
network 210.0.3.0 0.0.0.255
network 210.0.4.0 0.0.0.255
network 2.2.2.2 0.0.0.0
exit
router bgp 1500
bgp router-id 2.2.2.2
neighbor GRUPO_FULLMESH peer-group 
neighbor GRUPO_FULLMESH remote-as 1500
neighbor GRUPO_FULLMESH update-source lo0
neighbor 1.1.1.1 peer-group GRUPO_FULLMESH
neighbor 3.3.3.3 peer-group GRUPO_FULLMESH
neighbor 4.4.4.4 peer-group GRUPO_FULLMESH
neighbor 5.5.5.5 peer-group GRUPO_FULLMESH
neighbor 6.6.6.6 peer-group GRUPO_FULLMESH
exit

==============================
CISCO 3
==============================
enable
conf ter
hostname CISCO_3
inter lo0
ip addr 3.3.3.3 255.255.255.255
exit
inter e0/0
ip addr 210.0.1.1 255.255.255.0
no shut
exit
inter e0/1
ip addr 210.0.7.1 255.255.255.0
no shut
exit
inter e0/2
ip addr 210.0.8.1 255.255.255.0
no shut
exit
router eigrp 10
eigrp router-id 3.3.3.3
no auto-summary
network 210.0.1.0 0.0.0.255
network 210.0.7.0 0.0.0.255
network 210.0.8.0 0.0.0.255
network 3.3.3.3 0.0.0.0
exit
router bgp 1500
bgp router-id 3.3.3.3
neighbor GRUPO_FULLMESH peer-group 
neighbor GRUPO_FULLMESH remote-as 1500
neighbor GRUPO_FULLMESH update-source lo0
neighbor 1.1.1.1 peer-group GRUPO_FULLMESH
neighbor 2.2.2.2 peer-group GRUPO_FULLMESH
neighbor 4.4.4.4 peer-group GRUPO_FULLMESH
neighbor 5.5.5.5 peer-group GRUPO_FULLMESH
neighbor 6.6.6.6 peer-group GRUPO_FULLMESH
exit
ip dhcp pool LAN1
network 210.0.7.0 255.255.255.0
default-router 210.0.7.1
dns-server 8.8.8.8
exit
ip dhcp pool LAN2
network 210.0.8.0 255.255.255.0
default-router 210.0.8.1
dns-server 8.8.8.8
exit


==============================
CISCO 4
==============================
enable
conf ter
hostname CISCO_4
inter lo0
ip addr 4.4.4.4 255.255.255.255
exit
inter e0/0
ip addr 210.0.3.2 255.255.255.0
no shut
exit
inter e0/1
ip addr 210.0.5.1 255.255.255.0
no shut
exit
inter e0/2
ip addr 210.0.10.1 255.255.255.0
no shut
exit
router eigrp 10
eigrp router-id 4.4.4.4
no auto-summary
network 210.0.3.0 0.0.0.255
network 210.0.5.0 0.0.0.255
network 210.0.10.0 0.0.0.255
network 4.4.4.4 0.0.0.0
exit
router bgp 1500
bgp router-id 4.4.4.4
neighbor GRUPO_FULLMESH peer-group 
neighbor GRUPO_FULLMESH remote-as 1500
neighbor GRUPO_FULLMESH update-source lo0
neighbor 1.1.1.1 peer-group GRUPO_FULLMESH
neighbor 2.2.2.2 peer-group GRUPO_FULLMESH
neighbor 3.3.3.3 peer-group GRUPO_FULLMESH
neighbor 5.5.5.5 peer-group GRUPO_FULLMESH
neighbor 6.6.6.6 peer-group GRUPO_FULLMESH
exit
ip dhcp pool LAN1
network 210.0.10.0 255.255.255.0
default-router 210.0.10.1
dns-server 8.8.8.8
exit

==============================
CISCO 5
==============================
enable
conf ter
hostname CISCO_5
inter lo0
ip addr 5.5.5.5 255.255.255.255
exit
inter e0/0
ip addr 210.0.4.2 255.255.255.0
no shut
exit
inter e0/1
ip addr 210.0.6.1 255.255.255.0
no shut
exit
inter e0/2
ip addr 210.0.9.1 255.255.255.0
no shut
exit
router eigrp 10
eigrp router-id 5.5.5.5
no auto-summary
network 210.0.4.0 0.0.0.255
network 210.0.6.0 0.0.0.255
network 210.0.9.0 0.0.0.255
network 5.5.5.5 0.0.0.0
exit
router bgp 1500
bgp router-id 5.5.5.5
neighbor GRUPO_FULLMESH peer-group 
neighbor GRUPO_FULLMESH remote-as 1500
neighbor GRUPO_FULLMESH update-source lo0
neighbor 1.1.1.1 peer-group GRUPO_FULLMESH
neighbor 2.2.2.2 peer-group GRUPO_FULLMESH
neighbor 3.3.3.3 peer-group GRUPO_FULLMESH
neighbor 4.4.4.4 peer-group GRUPO_FULLMESH
neighbor 6.6.6.6 peer-group GRUPO_FULLMESH
exit
ip dhcp pool LAN1
network 210.0.9.0 255.255.255.0
default-router 210.0.9.1
dns-server 8.8.8.8
exit
==============================
CISCO 6
==============================
enable
conf ter
hostname CISCO_6
inter lo0
ip addr 6.6.6.6 255.255.255.255
exit
inter e0/0
ip addr 210.0.5.2 255.255.255.0
no shut
exit
inter e0/1
ip addr 210.0.6.3 255.255.255.0
no shut
exit
inter e0/2
ip addr 210.0.11.1 255.255.255.0
no shut
exit
inter e0/3
ip addr 210.0.12.1 255.255.255.0
no shut
exit
router eigrp 10
eigrp router-id 6.6.6.6
no auto-summary
network 210.0.5.0 0.0.0.255
network 210.0.6.0 0.0.0.255
network 210.0.11.0 0.0.0.255
network 210.0.12.0 0.0.0.255
network 6.6.6.6 0.0.0.0
exit
router bgp 1500
bgp router-id 6.6.6.6
neighbor GRUPO_FULLMESH peer-group 
neighbor GRUPO_FULLMESH remote-as 1500
neighbor GRUPO_FULLMESH update-source lo0
neighbor 1.1.1.1 peer-group GRUPO_FULLMESH
neighbor 2.2.2.2 peer-group GRUPO_FULLMESH
neighbor 3.3.3.3 peer-group GRUPO_FULLMESH
neighbor 4.4.4.4 peer-group GRUPO_FULLMESH
neighbor 5.5.5.5 peer-group GRUPO_FULLMESH
exit
ip dhcp pool LAN1
network 210.0.11.0 255.255.255.0
default-router 210.0.11.1
dns-server 8.8.8.8
exit
ip dhcp pool LAN2
network 210.0.12.0 255.255.255.0
default-router 210.0.12.1
dns-server 8.8.8.8
exit
==============================
CISCO 7
==============================
enable
conf ter
hostname CISCO_7
inter e0/0
ip addr 221.0.0.1 255.255.255.252
no shut
exit
inter e0/1
ip addr 221.0.0.5 255.255.255.252
no shut
exit
router bgp 200
neighbor 221.0.0.2 remote-as 1500
neighbor 221.0.0.6 remote-as 202
exit
==============================
CISCO 8
==============================
enable
conf ter
hostname CISCO_8
inter e0/0
ip addr 221.0.0.6 255.255.255.252
no shut
exit
inter e0/1
ip addr 221.0.0.9 255.255.255.252
no shut
exit
router bgp 202
neighbor 221.0.0.5 remote-as 200
neighbor 221.0.0.10 remote-as 2500
exit
==============================
CISCO 9
==============================
enable
conf ter
hostname CISCO_9
int lo0
ip addr 9.9.9.9 255.255.255.255
exit
inter e0/0
ip addr 221.0.0.38 255.255.255.252
no shut
exit
inter e0/1
ip addr 221.0.0.42 255.255.255.252
no shut
exit
router bgp 406
neighbor 14.14.14.14 remote-as 406
neighbor 14.14.14.14 update-source lo0
neighbor 14.14.14.14 next-hop-self
neighbor 221.0.0.41 remote-as 2500
exit
router isis 10
net 49.0000.0000.0000.0001.00
metric-style wide
exit
int e0/0
isis circuit-type level-1
ip router isis 10
exit
int lo0
isis circuit-type level-1
ip router isis 10
exit
==============================
CISCO 10
==============================
enable
conf ter
hostname CISCO_10
inter e0/0
ip addr 221.0.0.46 255.255.255.252
no shut
exit
inter e0/1
ip addr 221.0.0.50 255.255.255.252
no shut
exit
router bgp 500
neighbor 221.0.0.45 remote-as 1500
neighbor 221.0.0.49 remote-as 2500
exit
==============================
VyOS 11
==============================
configure 
set interfaces ethernet eth0 address 221.0.0.13/30
set interfaces ethernet eth1 address 221.0.0.17/30
set protocols bgp system-as 300
set protocols bgp parameters router-id 11.11.11.11
set protocols bgp neighbor 221.0.0.14 remote-as 1500
set protocols bgp neighbor 221.0.0.18 remote-as 302
set protocols bgp neighbor 221.0.0.14 address-family ipv4-unicast
set protocols bgp neighbor 221.0.0.18 address-family ipv4-unicast
commit
==============================
VyOS 12
==============================
configure 
set interfaces ethernet eth0 address 221.0.0.18/30
set interfaces ethernet eth1 address 221.0.0.21/30
set protocols bgp system-as 302
set protocols bgp parameters router-id 12.12.12.12
set protocols bgp neighbor 221.0.0.17 remote-as 300
set protocols bgp neighbor 221.0.0.22 remote-as 2500
set protocols bgp neighbor 221.0.0.17 address-family ipv4-unicast
set protocols bgp neighbor 221.0.0.22 address-family ipv4-unicast
commit
==============================
VyOS 13
==============================
configure 
set interfaces ethernet eth0 address 221.0.0.30/30
set interfaces ethernet eth1 address 221.0.0.33/30
set protocols bgp system-as 402
set protocols bgp parameters router-id 13.13.13.13
set protocols bgp neighbor 221.0.0.29 remote-as 400
set protocols bgp neighbor 221.0.0.34 remote-as 406
set protocols bgp neighbor 221.0.0.29 address-family ipv4-unicast
set protocols bgp neighbor 221.0.0.34 address-family ipv4-unicast
commit
==============================
VyOS 14
==============================
configure 
set interfaces ethernet eth0 address 221.0.0.34/30
set interfaces ethernet eth1 address 221.0.0.37/30
set interfaces loopback lo address 14.14.14.14/32 
set protocols isis net 49.0000.0000.0000.0002.00
set protocols isis metric-style wide
set protocols isis interface eth1 circuit-type level-1 
set protocols isis interface lo circuit-type level-1
set protocols bgp system-as 406
set protocols bgp parameters router-id 14.14.14.14
set protocols bgp neighbor 221.0.0.33 remote-as 402
set protocols bgp neighbor 9.9.9.9 remote-as 406
set protocols bgp neighbor 221.0.0.33 address-family ipv4-unicast
set protocols bgp neighbor 9.9.9.9 address-family ipv4-unicast
set protocols bgp neighbor 9.9.9.9 update-source lo
set protocols bgp neighbor 9.9.9.9 address-family ipv4-unicast nexthop-self
commit
==============================
VyOS 15
==============================
configure 
set interfaces ethernet eth0 address 220.0.3.2/24
set interfaces ethernet eth1 address 220.0.4.1/24
set interfaces ethernet eth2 address 220.0.9.1/24
set interfaces loopback lo address 15.15.15.15/32
set protocols ospf parameters router-id 15.15.15.15
set protocols ospf interface eth0 area 0.0.0.0
set protocols ospf interface eth1 area 0.0.0.0
set protocols ospf interface eth2 area 0.0.0.0
set protocols ospf interface lo area 0.0.0.0
set protocols bgp system-as 2500
set protocols bgp parameters router-id 15.15.15.15
set protocols bgp neighbor 17.17.17.17 remote-as 2500
set protocols bgp neighbor 18.18.18.18 remote-as 2500
set protocols bgp neighbor 19.19.19.19 remote-as 2500
set protocols bgp neighbor 20.20.20.20 remote-as 2500
set protocols bgp neighbor 17.17.17.17 address-family ipv4-unicast
set protocols bgp neighbor 18.18.18.18 address-family ipv4-unicast
set protocols bgp neighbor 19.19.19.19 address-family ipv4-unicast
set protocols bgp neighbor 20.20.20.20 address-family ipv4-unicast
set protocols bgp neighbor 17.17.17.17 update-source 15.15.15.15
set protocols bgp neighbor 18.18.18.18 update-source 15.15.15.15
set protocols bgp neighbor 19.19.19.19 update-source 15.15.15.15
set protocols bgp neighbor 20.20.20.20 update-source 15.15.15.15
set service dhcp-server shared-network-name LAN subnet 220.0.9.0/24 subnet-id 9
set service dhcp-server listen-interface eth2 
set service dhcp-server shared-network-name LAN option default-router 220.0.9.1 
set service dhcp-server shared-network-name LAN subnet 220.0.9.0/24 range clientes start 220.0.9.2 
set service dhcp-server shared-network-name LAN subnet 220.0.9.0/24 range clientes stop 220.0.9.252 
commit

==============================
H3C 16
==============================
system-view
ip ttl-expires enable
ip unreachables enable 
interface GE1/0
ip addr 221.0.0.26 255.255.255.252
exit
interface GE2/0
ip addr 221.0.0.29 255.255.255.252
exit
bgp 400
router-id 16.16.16.16
peer 221.0.0.25 as-number 1500
peer 221.0.0.30 as-number 402
address-family ipv4 unicast
peer 221.0.0.25 enable
peer 221.0.0.30 enable
exit
==============================
H3C 17
==============================
system-view
ip ttl-expires enable
ip unreachables enable
inter lo0
ip addr 17.17.17.17 255.255.255.255
exit
interface GE1/0
ip addr 221.0.0.10 255.255.255.252
exit
interface GE2/0
ip addr 221.0.0.22 255.255.255.252
exit
interface GE3/0
ip addr 221.0.0.41 255.255.255.252
exit
interface GE4/0
ip addr 221.0.0.49 255.255.255.252
exit
interface GE5/0
ip addr 220.0.1.2 255.255.255.0
exit
interface GE6/0
ip addr 220.0.2.1 255.255.255.0
exit
ospf 10 router-id 17.17.17.17
exit
interface range G5/0 G6/0 lo0
ospf 10 area 0.0.0.0
exit
bgp 2500
router-id 17.17.17.17
peer 221.0.0.9 as-number 202
peer 221.0.0.21 as-number 302
peer 221.0.0.42 as-number 406
peer 221.0.0.50 as-number 500
group BGP_FULLMESH internal
peer BGP_FULLMESH as-number 2500
peer BGP_FULLMESH source-address 17.17.17.17
peer 18.18.18.18 group BGP_FULLMESH
peer 19.19.19.19 group BGP_FULLMESH
peer 15.15.15.15 group BGP_FULLMESH
peer 20.20.20.20 group BGP_FULLMESH
address-family ipv4 unicast 
peer 221.0.0.9 enable
peer 221.0.0.21 enable
peer 221.0.0.42 enable
peer 221.0.0.50 enable
network 220.0.5.0 255.255.255.0
network 220.0.6.0 255.255.255.0
network 220.0.7.0 255.255.255.0
network 220.0.8.0 255.255.255.0
network 220.0.9.0 255.255.255.0
network 0.0.0.0 0.0.0.0
peer BGP_FULLMESH ena
peer BGP_FULLMESH next-hop-local
exit

ip prefix-list SERVER_21_23 index 1 permit 210.0.7.0 24
ip prefix-list SERVER_21_23 index 2 permit 210.0.9.0 24
ip prefix-list SERVER_22_24 index 1 permit 210.0.8.0 24
ip prefix-list SERVER_22_24 index 2 permit 210.0.10.0 24
ip prefix-list SERVER_25_26 index 1 permit 210.0.11.0 24
ip prefix-list SERVER_25_26 index 2 permit 210.0.12.0 24
route-policy RUTA_SERVER_21_23 permit node 1
apply local-preference 180
if-match ip address prefix-list SERVER_21_23
exit
route-policy RUTA_SERVER_22_24 permit node 1
apply local-preference 190
if-match ip address prefix-list SERVER_22_24
exit
route-policy RUTA_SERVER_25_26 permit node 1
apply local-preference 200
if-match ip address prefix-list SERVER_25_26
exit

bgp 2500
address-family ipv4 unicast 
peer 221.0.0.9 route-policy RUTA_SERVER_21_23 import
peer 221.0.0.21 route-policy RUTA_SERVER_22_24 import
peer 221.0.0.42 route-policy RUTA_SERVER_25_26 import 
exit
==============================
H3C 18
==============================
system-view
ip ttl-expires enable
ip unreachables enable
inter lo0
ip addr 18.18.18.18 255.255.255.255
exit
interface GE1/0
ip addr 220.0.1.1 255.255.255.0
exit
interface GE2/0
ip addr 220.0.5.1 255.255.255.0
exit
interface GE3/0
ip addr 220.0.6.1 255.255.255.0
exit
ospf 10 router-id 18.18.18.18
exit
interface range G1/0 G2/0 G3/0 lo0
ospf 10 area 0.0.0.0
exit
bgp 2500
router-id 18.18.18.18
group BGP_FULLMESH internal
peer BGP_FULLMESH as-number 2500
peer BGP_FULLMESH source-address 18.18.18.18
peer 17.17.17.17 group BGP_FULLMESH
peer 19.19.19.19 group BGP_FULLMESH
peer 15.15.15.15 group BGP_FULLMESH
peer 20.20.20.20 group BGP_FULLMESH
address-family ipv4 unicast 
peer BGP_FULLMESH ena
exit
dhcp enable
dhcp server forbidden-ip 220.0.5.1 220.0.5.10
dhcp server forbidden-ip 220.0.6.1 220.0.6.10
dhcp server ip-pool LAN
network 220.0.5.0 24
dns-list 8.8.8.8
gateway-list 220.0.5.1 
exit
inter g2/0
dhcp server apply ip-pool LAN
exit
dhcp server ip-pool LAN2
network 220.0.6.0 24
dns-list 8.8.8.8
gateway-list 220.0.6.1 
exit
inter g3/0
dhcp server apply ip-pool LAN2
exit
==============================
H3C 19
==============================
system-view
ip ttl-expires enable
ip unreachables enable
inter lo0
ip addr 19.19.19.19 255.255.255.255
exit
interface GE1/0
ip addr 220.0.2.2 255.255.255.0
exit
interface GE2/0
ip addr 220.0.3.1 255.255.255.0
exit
interface GE3/0
ip addr 220.0.7.1 255.255.255.0
exit
interface GE4/0
ip addr 220.0.8.1 255.255.255.0
exit
ospf 10 router-id 19.19.19.19
exit
interface range G1/0 G2/0 G3/0 G4/0 lo0
ospf 10 area 0.0.0.0
exit
bgp 2500
router-id 19.19.19.19
group BGP_FULLMESH internal
peer BGP_FULLMESH as-number 2500
peer BGP_FULLMESH source-address 19.19.19.19
peer 17.17.17.17 group BGP_FULLMESH
peer 18.18.18.18 group BGP_FULLMESH
peer 15.15.15.15 group BGP_FULLMESH
peer 20.20.20.20 group BGP_FULLMESH
address-family ipv4 unicast 
peer BGP_FULLMESH ena
exit
exit
dhcp enable
dhcp server forbidden-ip 220.0.7.1 220.0.7.10
dhcp server forbidden-ip 220.0.8.1 220.0.8.10
dhcp server ip-pool LAN
network 220.0.7.0 24
dns-list 8.8.8.8
gateway-list 220.0.7.1 
exit
inter g3/0
dhcp server apply ip-pool LAN
exit
dhcp server ip-pool LAN2
network 220.0.8.0 24
dns-list 8.8.8.8
gateway-list 220.0.8.1 
exit
inter g4/0
dhcp server apply ip-pool LAN2
exit
===============================
MIKROTIK 20
===============================
/routing bgp instance
add as=2500 disabled=no name=BGP_AS2500 router-id=20.20.20.20
/routing ospf instance
add disabled=no name=ospf-instance-1 originate-default=always router-id=\
    20.20.20.20
/routing ospf area
add disabled=no instance=ospf-instance-1 name=ospf-area-1
/ip address
add address=220.0.4.2/24 interface=ether2 network=220.0.4.0
add address=20.20.20.20 interface=lo network=20.20.20.20
/ip dhcp-client
add interface=ether1
/ip firewall nat
add action=masquerade chain=srcnat dst-address=0.0.0.0/0 src-address=0.0.0.0/0
/routing bgp connection
add as=2500 disabled=no instance=BGP_AS2500 local.address=20.20.20.20 .role=\
    ibgp name=bgp1 remote.address=15.15.15.15/32 .as=2500 routing-table=main
add as=2500 disabled=no instance=BGP_AS2500 local.address=20.20.20.20 .role=\
    ibgp name=bgp2 remote.address=17.17.17.17/32 .as=2500 routing-table=main
add as=2500 disabled=no instance=BGP_AS2500 local.address=20.20.20.20 .role=\
    ibgp name=bgp3 remote.address=18.18.18.18/32 .as=2500 routing-table=main
add as=2500 disabled=no instance=BGP_AS2500 local.address=20.20.20.20 .role=\
    ibgp name=bgp4 remote.address=19.19.19.19/32 .as=2500 routing-table=main
/routing ospf interface-template
add area=ospf-area-1 disabled=no interfaces=ether2,lo



